; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	spectrograph2 - mode
	spectrograph1 - mode
	image0 - mode
	Star3 - direction
	GroundStation0 - direction
	Star1 - direction
	Star2 - direction
	Phenomenon4 - direction
	Star5 - direction
	Star6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
	Planet18 - direction
	Star19 - direction
	Phenomenon20 - direction
	Star21 - direction
	Star22 - direction
	Phenomenon23 - direction
	Star24 - direction
	Planet25 - direction
	Star26 - direction
	Planet27 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph2)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet27)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star1)
	(supports instrument4 image0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 image0)
	(supports instrument5 spectrograph1)
	(supports instrument5 spectrograph2)
	(calibration_target instrument5 Star2)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon16)
	(supports instrument6 spectrograph1)
	(supports instrument6 image0)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon13)
	(supports instrument7 spectrograph2)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star1)
	(supports instrument8 image0)
	(calibration_target instrument8 Star2)
	(supports instrument9 spectrograph1)
	(calibration_target instrument9 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star19)
	(supports instrument10 image0)
	(calibration_target instrument10 Star2)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon16)
)
(:goal (and
	(pointing satellite2 Phenomenon23)
	(pointing satellite3 Star7)
	(pointing satellite4 Phenomenon16)
	(have_image Phenomenon4 spectrograph2)
	(have_image Star5 spectrograph1)
	(have_image Star6 spectrograph2)
	(have_image Star7 spectrograph1)
	(have_image Star8 spectrograph2)
	(have_image Star9 spectrograph2)
	(have_image Phenomenon10 spectrograph2)
	(have_image Phenomenon11 image0)
	(have_image Planet14 spectrograph1)
	(have_image Star15 spectrograph1)
	(have_image Star17 spectrograph2)
	(have_image Planet18 image0)
	(have_image Phenomenon20 spectrograph1)
	(have_image Star21 spectrograph1)
	(have_image Star22 image0)
	(have_image Star24 image0)
	(have_image Planet25 image0)
	(have_image Star26 spectrograph2)
	(have_image Planet27 image0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 1 of 22
2. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 1 of 22
3. (turn_to satellite4 star2 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 star2)
   goals met: 0 of 22
4. (calibrate satellite4 instrument10 star2)
   added: (calibrated instrument10)
   goals met: 0 of 22
5. (turn_to satellite4 phenomenon11 star2)
   deleted: (pointing satellite4 star2)
   added: (pointing satellite4 phenomenon11)
   goals met: 0 of 22
6. (take_image satellite4 phenomenon11 instrument10 image0)
   added: (have_image phenomenon11 image0)
   goals met: 1 of 22
7. (turn_to satellite4 phenomenon16 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 phenomenon16)
   goals met: 2 of 22
8. (turn_to satellite3 star7 star19)
   deleted: (pointing satellite3 star19)
   added: (pointing satellite3 star7)
   goals met: 3 of 22
9. (turn_to satellite2 phenomenon10 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 22
10. (turn_to satellite2 star2 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 star2)
   goals met: 3 of 22
11. (calibrate satellite2 instrument6 star2)
   added: (calibrated instrument6)
   goals met: 3 of 22
12. (turn_to satellite2 phenomenon10 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 phenomenon10)
   goals met: 3 of 22
13. (take_image satellite2 phenomenon10 instrument6 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 4 of 22
14. (turn_to satellite2 phenomenon20 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 phenomenon20)
   goals met: 4 of 22
15. (take_image satellite2 phenomenon20 instrument6 spectrograph1)
   added: (have_image phenomenon20 spectrograph1)
   goals met: 5 of 22
16. (turn_to satellite2 phenomenon23 phenomenon20)
   deleted: (pointing satellite2 phenomenon20)
   added: (pointing satellite2 phenomenon23)
   goals met: 6 of 22
17. (turn_to satellite4 planet18 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 planet18)
   goals met: 5 of 22
18. (take_image satellite4 planet18 instrument10 image0)
   added: (have_image planet18 image0)
   goals met: 6 of 22
19. (turn_to satellite4 phenomenon16 planet18)
   deleted: (pointing satellite4 planet18)
   added: (pointing satellite4 phenomenon16)
   goals met: 7 of 22
20. (turn_to satellite4 planet25 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 planet25)
   goals met: 6 of 22
21. (take_image satellite4 planet25 instrument10 image0)
   added: (have_image planet25 image0)
   goals met: 7 of 22
22. (turn_to satellite4 phenomenon16 planet25)
   deleted: (pointing satellite4 planet25)
   added: (pointing satellite4 phenomenon16)
   goals met: 8 of 22
23. (turn_to satellite4 planet27 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 planet27)
   goals met: 7 of 22
24. (take_image satellite4 planet27 instrument10 image0)
   added: (have_image planet27 image0)
   goals met: 8 of 22
25. (turn_to satellite4 phenomenon16 planet27)
   deleted: (pointing satellite4 planet27)
   added: (pointing satellite4 phenomenon16)
   goals met: 9 of 22
26. (turn_to satellite4 star22 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 star22)
   goals met: 8 of 22
27. (take_image satellite4 star22 instrument10 image0)
   added: (have_image star22 image0)
   goals met: 9 of 22
28. (turn_to satellite4 phenomenon16 star22)
   deleted: (pointing satellite4 star22)
   added: (pointing satellite4 phenomenon16)
   goals met: 10 of 22
29. (turn_to satellite4 star24 phenomenon16)
   deleted: (pointing satellite4 phenomenon16)
   added: (pointing satellite4 star24)
   goals met: 9 of 22
30. (take_image satellite4 star24 instrument10 image0)
   added: (have_image star24 image0)
   goals met: 10 of 22
31. (turn_to satellite4 phenomenon16 star24)
   deleted: (pointing satellite4 star24)
   added: (pointing satellite4 phenomenon16)
   goals met: 11 of 22
32. (turn_to satellite2 phenomenon4 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 phenomenon4)
   goals met: 10 of 22
33. (take_image satellite2 phenomenon4 instrument6 spectrograph2)
   added: (have_image phenomenon4 spectrograph2)
   goals met: 11 of 22
34. (turn_to satellite2 phenomenon23 phenomenon4)
   deleted: (pointing satellite2 phenomenon4)
   added: (pointing satellite2 phenomenon23)
   goals met: 12 of 22
35. (turn_to satellite2 planet14 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 planet14)
   goals met: 11 of 22
36. (take_image satellite2 planet14 instrument6 spectrograph1)
   added: (have_image planet14 spectrograph1)
   goals met: 12 of 22
37. (turn_to satellite2 phenomenon23 planet14)
   deleted: (pointing satellite2 planet14)
   added: (pointing satellite2 phenomenon23)
   goals met: 13 of 22
38. (turn_to satellite2 star15 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star15)
   goals met: 12 of 22
39. (take_image satellite2 star15 instrument6 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 13 of 22
40. (turn_to satellite2 phenomenon23 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 phenomenon23)
   goals met: 14 of 22
41. (turn_to satellite2 star17 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star17)
   goals met: 13 of 22
42. (take_image satellite2 star17 instrument6 spectrograph2)
   added: (have_image star17 spectrograph2)
   goals met: 14 of 22
43. (turn_to satellite2 phenomenon23 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 phenomenon23)
   goals met: 15 of 22
44. (turn_to satellite2 star21 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star21)
   goals met: 14 of 22
45. (take_image satellite2 star21 instrument6 spectrograph1)
   added: (have_image star21 spectrograph1)
   goals met: 15 of 22
46. (turn_to satellite2 phenomenon23 star21)
   deleted: (pointing satellite2 star21)
   added: (pointing satellite2 phenomenon23)
   goals met: 16 of 22
47. (turn_to satellite2 star26 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star26)
   goals met: 15 of 22
48. (take_image satellite2 star26 instrument6 spectrograph2)
   added: (have_image star26 spectrograph2)
   goals met: 16 of 22
49. (turn_to satellite2 phenomenon23 star26)
   deleted: (pointing satellite2 star26)
   added: (pointing satellite2 phenomenon23)
   goals met: 17 of 22
50. (turn_to satellite2 star5 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star5)
   goals met: 16 of 22
51. (take_image satellite2 star5 instrument6 spectrograph1)
   added: (have_image star5 spectrograph1)
   goals met: 17 of 22
52. (turn_to satellite2 phenomenon23 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 phenomenon23)
   goals met: 18 of 22
53. (turn_to satellite2 star6 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star6)
   goals met: 17 of 22
54. (take_image satellite2 star6 instrument6 spectrograph2)
   added: (have_image star6 spectrograph2)
   goals met: 18 of 22
55. (turn_to satellite2 phenomenon23 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon23)
   goals met: 19 of 22
56. (turn_to satellite2 star7 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star7)
   goals met: 18 of 22
57. (take_image satellite2 star7 instrument6 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 19 of 22
58. (turn_to satellite2 phenomenon23 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon23)
   goals met: 20 of 22
59. (turn_to satellite2 star8 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star8)
   goals met: 19 of 22
60. (take_image satellite2 star8 instrument6 spectrograph2)
   added: (have_image star8 spectrograph2)
   goals met: 20 of 22
61. (turn_to satellite2 phenomenon23 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon23)
   goals met: 21 of 22
62. (turn_to satellite2 star9 phenomenon23)
   deleted: (pointing satellite2 phenomenon23)
   added: (pointing satellite2 star9)
   goals met: 20 of 22
63. (take_image satellite2 star9 instrument6 spectrograph2)
   added: (have_image star9 spectrograph2)
   goals met: 21 of 22
64. (turn_to satellite2 phenomenon23 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 phenomenon23)
   goals met: 22 of 22
